<?php

namespace Database\Seeders;

use App\Models\Place;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PlaceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Place::factory()->count(30)->create();

        $places = [
            'س 19 ش ع',
            '(حياة كريمة) الشعبة الهندسية',
            'استراحات الضباط',
            'استراحات الضباط بمكتب القائد',
            'استراحات القائد بالغردقة',
            'استراحة السيد القائد',
            'الشعبة الهندسية',
            'الشعبة الهندسية (حرفيين)',
            'الشعبة الهندسية (غلق مسارب)',
            'الفرع البيطري',
            'المركز الإضافي بشرق العوينات',
            'المركز الرياضي',
            'المشروعات الإنتاجية',
            'المطبعة',
            'الميس المجمع رقم 6',
            'النيابة العسكرية',
            'حرس السيد رئيس أركان',
            'حرس القائد',
            'حرس شرف',
            'حملة السيد القائد',
            'حملة السيد رئيس أركان',
            'س 717 طب',
            'س 766 طب',
            'شعبة الإمداد والتموين',
            'شعبة التنظيم والإدارة',
            'شعبة تدريب',
            'شعبة عمليات',
            'شئون ضباط العامة (لواء أح / عادل صبحي)',
            'غرف حبس منقباد',
            'فرع إعداد الدولة للحرب',
            'فرع الاستطلاع',
            'فرع الأسلحة والذخيرة',
            'فرع الإشارة',
            'فرع الحرب الإلكترونية',
            'فرع الشرطة العسكرية',
            'فرع الشئون المعنوية',
            'فرع القضاء',
            'فرع الكيما',
            'فرع المحاكم',
            'فرع المدرعات',
            'فرع المركبات',
            'فرع النظم',
            'فرع شئون الضباط',
            'فرع مالي أسيوط',
            'فرقة الموسيقى',
            'فصيلة الميني باص',
            'فندق الضباط الجديد',
            'قائد قاعدة برنيس',
            'قسم الأمن الحربي',
            'قيادة الدفاع الجوي',
            'قيادة المدفعية',
            'قيادة حرس حدود',
            'ك المقر',
            'ك النقل المختلط',
            'ل أ ح / وليد معهد المدرعات',
            'محطة قنا العسكرية',
            'محكمة أسوان العسكرية',
            'مست برنيس العسكري',
            'مست سوهاج العسكري',
            'مست منقباد العسكري',
            'مستودع 19 تعيينات',
            'مستودع 38 مهمات',
            'مستودع 38 مهمات (قسم قنا)',
            'مستودع 5 مساحة',
            'مستودع 9 طب',
            'معسكر الاستقبال',
            'معمل اللغات',
            'مغسلة الأبطال',
            'مكتب التنسيق والمتابعة',
            'مكتب السيد القائد',
            'مكتب السيد رئيس أركان',
            'مكتب السيد مساعد رئيس أركان لواء أ ح / شريف سعيد',
            'مكتب مالي القائد',
            'مكتب مساعد السيد قائد م ج ع (ل أ ح / بهاء السيد)',
            'مكتب مساعد رئيس أركان المنطقة (لواء أح / مصطفى)',
            'مكتب مساعد قائد المنطقة للأزمات (لواء أح / سيد رضوان)',
            'منفذ حدربة البري / قطاع برنيس العسكري',
            'مؤخرة المنطقة الجنوبية العسكرية',
            'مؤخرة م ج ع (حملة السيد القائد)',
            'مؤخرة م ج ع (حملة السيد رئيس أركان)',
            'ميس الضباط',
            'ورشة 151 مدرعات',
            'ورشة 314 مركبات',
        ];

        foreach ($places as $place) {
            Place::firstOrCreate([
                'name' => $place,
            ]);
        }
    }
}
