<?php

namespace Database\Seeders;

use App\Models\Unit;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class UnitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // Unit::factory()->count(20)->create();
        $units = array_unique([
            'الفوج 625 إشارة',
            'المستشفى العسكرى بسوهاج 50سرير',
            'المستشفى العسكرى بمساكن النوبة (200 سرير) تنظيم خاص',
            'المستشفى العسكرى بمساكن النوبة (200 سرير) تنظيم خاص العسكري',
            'المستودع الفرعى للأسلحة والذخيرة رقم 30',
            'المستودع الفرعي للأسلحة والذخيرة رقم 2',
            'المستودع الفرعي للمطبوعات والأدوات الكتابية رقم 27',
            'الورشة المتوسطة لمعدات القياس المعايرة رقم 2',
            'خدمة وطنية مستوى(ب)',
            'س 101 مد',
            'س 102 مد',
            'س 103 مد',
            'س 104 مد',
            'س 117 اشارة',
            'س 117 أهرام',
            'س 117 سطع',
            'س 117 م ع',
            'س 133 اشارة',
            'س 141 م ع',
            'س 166 أهرام',
            'س 166 سطع',
            'س 305 اشارة',
            'س 305 اهرام',
            'س 305 سطع',
            'س 305 طب',
            'س 305 م ع',
            'س 305 نقل',
            'س 305 ورشة',
            'س 5 لنشات',
            'س 717 طب',
            'س 717 نقل',
            'س 766 طب',
            'س 766 نقل',
            'س الكشف عن المهربات',
            'سرية 19 شرطة عسكرية قاعدة مقلة',
            'سرية 194 شرطة عسكرية قاعدة مقلة',
            'سرية 30 شرطة عسكرية قاعدة مقلة',
            'سرية 4 اطفاء',
            'سرية 5 نقل افراد',
            'سرية اشاره مقله',
            'سرية تشغيل بوابة الكشف عن مهربات',
            'طاقم استخدام وتشغيل ميدان رماية مشاة',
            'طاقم الخدمات البيطرية رقم 77',
            'طاقم الخدمات البيطرية رقم 78',
            'طاقم الخدمات البيطرية رقم 79',
            'طاقم الخدمات البيطرية رقم 80',
            'طاقم الخدمات البيطرية رقم 81',
            'طاقم الخدمات البيطرية رقم 82',
            'طاقم الخدمات البيطرية رقم 83',
            'طاقم الخدمات البيطرية رقم 84',
            'طاقم الخدمات البيطرية رقم 85',
            'طاقم الخدمات البيطرية رقم 86',
            'غرفه حبس قطاع البحر الأحمر العسكرى (مستوي ج)',
            'غرفه حبس مركزية (مستوي ا)',
            'غرفه حبس مركزية (مستوي ج)',
            'ف 117 ش ع',
            'ف 117 كيما',
            'ف 125 ش ع',
            'ف 305 ش ع',
            'ف 305 كيما',
            'ف 35 كيما',
            'ف 83 ش ع',
            'ف 85 ش ع (الإقصر)',
            'فصيلة 52 شرطة عسكرية رئاسه عامه',
            'فصيلة 82 شرطة عسكرية رئاسه عامه',
            'فصيلة 84 شرطة عسكرية رئاسه عامه',
            'فصيلة التحفظ على الاراضى',
            'فصيلة حرب كيما م ج ع',
            'قسم 5 شرطة عسكرية نيابات',
            'قسم بحوث فنيه وتطوير',
            'قيا ل 117 مش ميكا',
            'قيا ل 166 مش ميكا',
            'قيا ل 305 مش مقل',
            'قيادة المنطقه الجنوبيه العسكريه',
            'قيادة قطاع أسوان العسكري',
            'قيادة قطاع البحر الأحمر العسكري',
            'قيادة قطاع برنيس العسكري',
            'قيادة محطة قنا العسكرية',
            'ك 107 حرس حدود ساحلى',
            'ك 108 حرس حدود ساحلى',
            'ك 14 حرس حدود',
            'ك 15 حرس حدود',
            'ك 155 مش ميكا',
            'ك 16 حرس حدود',
            'ك 17 حرس حدود',
            'ك 18 حرس حدود',
            'ك 188 مد م',
            'ك 235 بب',
            'ك 302 مد',
            'ك 302 مد م',
            'ك 313 بب',
            'ك 360 مش',
            'ك 360 مش ميكا',
            'ك 362 مش',
            'ك 362 مش ميكا',
            'ك 444 مش ميكا',
            'ك 515 د جو',
            'ك 515 مش ميكا',
            'ك 560 د جو',
            'ك 561 د جو',
            'ك 740 بب',
            'ك 824 مد',
            'ك 888 مش ميكا',
            'ك 900 مش',
            'ك 901 مش',
            'ك 902 مش',
            'كتيبة 336 مشاة ميكانيكي مقلة',
            'كتيبة 4 دبابات مقلة',
            'كتيبة المقر',
            'كتيبة مهندسين عسكريين مختلط',
            'كتيبة نقل مختلط مقله',
            'كتيبه 815 مد مقله',
            'مجمع ميادين رماية رقم 23',
            'مجمع ميادين رماية رقم 24',
            'مجمع ميادين رماية رقم 25',
            'مدرسه معركه امداد بالرجال',
            'مركز الاشعاع الثقافى',
            'مركز البولينج',
            'مست قنا العسكرى',
            'مستشفى جراحه ميداني رقم 23',
            'مستشفى عسكري بمنقباد',
            'مستشفي برنيس العسكري بطاقة (50 سرير)',
            'مستودع 549 إشغال',
            'مستودع المهمات الفرعي رقم 38',
            'مستودع الوقود الفرعي رقم 21',
            'مستودع الوقود الفرعي رقم 27',
            'مستودع الوقود الفرعي رقم 30',
            'مستودع تعينات مختلط رقم 19',
            'مستودع تعينات مختلط رقم 20',
            'مستودع تعينات مختلط رقم 21',
            'مستودع تعينات مختلط رقم 22',
            'مستودع طبي (تنظيم خاص) رقم 9',
            'مستودع وورشة حرب كيما مستوي (ج) رقم 9',
            'معمل اللغات',
            'معمل بيطري فرعي رقم 6',
            'ميس مجمع رقم 6',
            'نقطة طبية بشرق العوينات',
            'نقطة طبية مجهزة بشرق العوينات',
            'نقطه طبيه بحلايب',
            'نقطه طبيه بشلاتين',
            'وحدة الأسلحة والمعدات رقم 75',
            'ورشة 151 مدرعات',
            'ورشة القياس والمعايرة رقم 2',
            'ورشة اللواء',
            'ورشة ل 305 مش',
            'ورشة مركبات الجيش الخفيفة',
            'ورشة مركبات الجيش الخفيفة باسوان',
            'ورشة مركبات المحطة رقم 304',
            'ورشة مركبات محطه رقم 314',
            'ورشة مركبات قطاع برنيس',
        ]);

        foreach ($units as $unit) {
            Unit::firstOrCreate([
                'name' => trim($unit),
            ]);
        }
    }

}

// 'س103 مد'            // احذفها
// 'س 103 مد'           // احتفظ بها

// 'ك 15 ح ح '          // احذفها
// 'ك 15 ح ح'           // احتفظ بها

// 'ك 17 حرس حدود '     // احذفها
// 'ك 17 حرس حدود'      // احتفظ بها

// 'ك 16 ح ح '          // احذفها
// 'ك 16 ح ح'           // احتفظ بها

// 'قيادة قطاع برنيس العسكري ' // احذفها
// 'قيادة قطاع برنيس العسكري'  // احتفظ بها

// 'كتيبة نقل مختلط  مقله '    // احذفها
// 'كتيبة نقل مختلط  مقله'     // احتفظ بها

// 'غرفه حبس مركزية (مستوي ج) ' // احذفها
// 'غرفه حبس مركزية (مستوي ج)'  // احتفظ بها

// 'نقطه طبیه بشلاتین '        // احذفها
// 'نقطه طبيه بشلاتين'         // احتفظ بها